Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: To display an icon, you must specify a non-empty title.
fr: Pour afficher une icône, vous devez indiquer un titre non vide.

source: The icon appears on the same row as the title and thus requires a title to be present.
fr: L'icône apparaît sur la même ligne que le titre et nécessite donc qu'un titre soit présent.

source: GUI Control update functions Reference
fr: GUI Control update - Référence Fonctions

source: ; will return 1
fr: retourne 1

source: The handle of the window to use.
fr: Le handle de la fenêtre à utiliser.

source: If omitted the "current" window will be used.
fr: En cas d'omission, la fenêtre 'courante' sera utilisée.

source: a five-element array that containing the mouse cursor information:
fr: Retourne un tableau de cinq éléments qui contient des informations sur le curseur de la souris :

source: $aArray[0] = X coord (horizontal)
fr: $aArray[0] = coord X (horizontal)

source: $aArray[1] = Y coord (vertical)
fr: $aArray[1] = coord Y (vertical)

source: $aArray[2] = Primary down (1 if pressed, 0 if not pressed)
fr: $aArray[2] = bouton gauche pressé (1=pressé, 0=non pressé)

source: $aArray[3] = Secondary down (1 if pressed, 0 if not pressed)
fr: $aArray[3] = bouton droit pressé (1=pressé, 0=non pressé)

source: $aArray[4] = ID of the control that the mouse cursor is hovering over (or 0 if none)
fr: $aArray[4] = ID du contrôle que le curseur de la souris survole (ou 0 si aucun)

source: The coordinates given are relative to the GUI window (known as client coords).
fr: Les coordonnées données sont relatives à la fenêtre GUI (connu sous le nom de coordonnées client ).

source: If the "winhandle" parameter is used then the specified window becomes the new "current" window.
fr: Si le paramètre 'winhandle' est utilisé, alors la fenêtre spécifiée devient la nouvelle fenêtre 'courante'.

source: The mouse cursor position is successful only on an window created by a GUICreate().
fr: La position du curseur de la souris n'est couronnée de succès que sur une fenêtre créée par un GUICreate().

source: When no winhandle it will be successful if the GUI Windows is active.
fr: Quand il n'y a pas de handle de fenêtre, ce sera un succès seulement si la fenêtre GUI est active.

source: ListViewItem or TreeViewItem controlID will never be returned, only the parent Listview or TreeView control ID is.
fr: Le controlID d'un ListViewItem ou d'un TreeViewItem ne sera jamais retourné, seul le controlID du parent ListView ou TreeView le sera.

source: return extended information in an array.
fr: retour d'informations complémentaires dans un tableau.

source: 0 = (default) Returns a single event.
fr: 0 = (par défaut ) Retourne un événement unique.

source: 1 = returns an array containing the event and extended information.
fr: 1 = retourne un tableau contenant l'événement et des informations complémentaires.

source: Returns an event, or an array depending on the "advanced" parameter.
fr: Retourne un événement, ou un tableau selon le paramètre "advanced".

source: The "event" returned is the control ID of the control sending the message, or it is a special event (like the window is closing, minimizing).
fr: L'événement retourné est l'ID du contrôle qui envoie le message, ou un événement spécial (comme la fermeture de la fenêtre, fenêtre minimisé).

source: Or if there is no message, the event is 0.
fr: Or s'il n'y a pas de message, l'événement est égal à 0.

source: the ID of the control sending the message
fr: L'ID du contrôle qui a envoyé le message

source: No event
fr: Aucun évènement

source: dialog box being closed (either by defined button or system menu).
fr: boîte de dialogue fermée (par bouton défini, ou par menu système).

source: dialog box minimized with Windows title bar button.
fr: boîte de dialogue minimisée avec le menu système.

source: dialog box restored by click on task bar icon.
fr: boîte de dialogue restaurée par clic sur l'icône de la barre de tâche.

source: dialog box maximized with Windows title bar button.
fr: boîte de dialogue maximisée avec le menu système.

source: the mouse cursor has moved.
fr: le curseur de la souris s'est déplacé.

source: the primary mouse button was pressed.
fr: le bouton principal de la souris a été enfoncé.

source: the primary mouse button was released.
fr: le bouton principal de la souris a été relâché.

source: the secondary mouse button was pressed.
fr: le bouton secondaire de la souris a été enfoncé.

source: the secondary mouse button was released.
fr: le bouton secondaire de la souris a été relâché.

source: dialog box has been resized.
fr: boîte de dialogue redimensionnée.

source: End of a Drag&Drop action @GUI_DragId, @GUI_DragFile and @GUI_DropId will be used to retrieve the ID's/file corresponding to the involve control.
fr: Fin d'une action glisser-déposer.@GUI_DragId, @GUI_DragFile et @GUI_DropId seront utilisés pour récupérer de l'ID/fichier du contrôle impliqué.

source: When using the "advanced" parameter the information is returned in an array with extended information:
fr: Lorsque vous utilisez le paramètre "avancé" les informations sont retournées dans un tableau avec des informations complémentaires:

source: $aArray[0] = 0 or Event ID or Control ID
fr: $aArray[0] = 0 ou l'ID de l'événement ou l'ID du contrôle

source: $aArray[1] = The window handle the event is from
fr: $aArray[1] = Le handle de la fenêtre où l'événement s'est déclenché

source: $aArray[2] = The control handle the event is from (if applicable)
fr: $aArray[2] = Le handle du contrôle où l'événement s'est déclenché (le cas échéant)

source: $aArray[3] = The current X position of the mouse cursor (relative to the GUI window)
fr: $aArray[3] = L'abscisse X du curseur de la souris (relative à la fenêtre GUI)

source: $aArray[4] = The current Y position of the mouse cursor (relative to the GUI window)
fr: $aArray[4] = L'ordonnée Y du curseur de la souris (relative à la fenêtre GUI)

source: If the GUIOnEventMode option is set to 1 then the return from GUIGetMsg is always 0 and the @error is set to 1.
fr: Si l'option de GUIOnEventMode est réglé à 1, alors le retour de GUIGetMsg est toujours 0 et @error est mis à 1.

source: If the option GUIEventOptions is set to 1 the minimize, restore and maximize button will not do any action on the window just a simple notification.
fr: Si l'option GUIEventOptions est fixé à 1, les boutons minimise, restaure et maximise n'auront aucun effet sur la fenêtre, juste une simple notification.

source: This function automatically idles the CPU when required so that it can be safely used in tight loops without hogging all the CPU.
fr: Cette fonction ralentit automatiquement le CPU lorsque cela est nécessaire de sorte qu'elle peut être utilisée sans danger en boucles serrées sans monopoliser tous les CPU.

source: Information about the mouse position and the hovering control can be retrieved with GUIGetCursorInfo().
fr: Les informations sur la position de la souris et sur le contrôle survolé peuvent être récupérés avec GUIGetCursorInfo().

source: No event is fired when the mouse is over a control so GUIGetCursorInfo() must be called to retrieve the controlID.
fr: Aucun événement n'est déclenché lorsque la souris est sur un contrôle donc GUIGetCursorInfo() doit être appelée pour récupérer le controlID.

source: Example - Press the button to see the value of the radio boxes
fr: Exemple - Appuyez sur le bouton pour voir la valeur des boutons radio

source: The script also detects state changes (closed/minimized/timeouts, etc).
fr: Le script détecte également les changements d'état (fermé/minimisé/délai d'attente, etc).

source: Create the controls
fr: Crée les contrôles

source: Init our vars that we will use to keep track of GUI events
fr: Initialise les variables que nous allons utiliser pour garder une trace des événements de la GUI

source: We will assume 0 = first radio button selected, 2 = last button
fr: Nous supposerons que 0 = premier bouton radio sélectionné, 2 = dernier bouton

source: Show the GUI
fr: Affiche la GUI

source: In this message loop we use variables to keep track of changes to the radios, another
fr: Dans cette boucle de message, nous utilisons des variables pour garder une trace des changements apportés aux radioBoutons, une autre

source: way would be to use GUICtrlRead() at the end to read in the state of each control
fr: façon serait d'utiliser GUICtrlRead() à la fin de la lecture de l'état de chaque contrôle

source: Create a GUI.
fr: Crée une GUI.

source: Create a button.
fr: Crée un bouton.

source: Display the GUI
fr: Affiche la GUI

source: Initialize a Local variable.
fr: Initialise une variable locale.

source: Assign to $aMsg the advanced GUI messages.
fr: Assigne à $aMsg les messages GUI avancés.

source: Switch from GUIs
fr: Selon la GUI

source: The event comes from the GUI1
fr: L'événement vient de la GUI1

source: Switch from event ID
fr: Selon l'ID de l'événement

source: The event comes from the GUI2
fr: L'événement vient de la GUI2

source: a two-element array that containing the styles information:
fr: Retourne un tableau à deux éléments qui contient les informations sur les styles :

source: Be careful Style changes after GUISetState().
fr: Soyez prudents, les styles changent après GUISetState().

source: be careful the style change after opening
fr: attention le style change après l'ouverture

source: A Windows Message ID (see Appendix:
fr: Un ID de Messages Windows (Voir Appendice:

source: Windows Message Codes).
fr: Codes des Messages Windows ).

source: The name of the user function to call when the message appears or an empty string "" to unregister a message.
fr: Le nom de la fonction utilisateur à appeler lorsque le message est reçu ou une chaîne vide "" pour annuler l'inscription du message.

source: Parameter
fr: Paramètre

source: The Window handle of the GUI in which the message appears.
fr: Le handle de la fenêtre GUI dans laquelle le message est reçu.

source: The Windows message ID.
fr: L'ID du message Windows.

source: The first message parameter as hex value.
fr: Le premier paramètre du message sous forme de valeur hexadécimale.

source: The second message parameter as hex value.
fr: Le deuxième paramètre du message sous forme de valeur hexadécimale.

source: Up to 256 user functions can be registered for message IDs.
fr: Jusqu'à 256 fonctions utilisateur peuvent être enregistrés pour les IDs de message.

source: By default after finishing the user function the AutoIt internal message handler will be proceed.
fr: Par défaut après avoir terminée la fonction utilisateur le gestionnaire du message interne de AutoIt sera actif.

source: That won't be if your Return a value (See WM_COMMAND in example) or if you use the keyword 'Return' without any value.
fr: Ce ne sera pas le cas si vous utilisez un Return avec une valeur (voir WM_COMMAND dans l'exemple) ou si vous utilisez le mot-clé 'Return' sans aucune valeur.

source: By using 'Return' without any return value the AutoIt internal message handler (if there is one for this message) will NOT be proceed!
fr: En utilisant 'Return' sans valeur de retour, le gestionnaire de message interne AutoIt (s'il en existe un pour ce message) ne pourra PAS s'activer!

source: If you want AutoIt to run its internal handler for a message, return the variable $GUI_RUNDEFMSG (in GUIConstantsEx.au3) from the function (see also examples) !!!
fr: Si vous voulez qu'AutoIt exécute ses gestionnaires internes pour un message, retournez la variable $GUI_RUNDEFMSG (dans GUIConstantsEx.au3 ) à partir de la fonction (voir aussi les exemples) !!!

source: I.e. if you want to return earlier than the user function ends and also proceed the AutoIt internal message handler.
fr: Par exemple, si vous désirez un Return plus tôt que la fin de la fonction utilisateur et également activer le gestionnaire de message interne d'AutoIt.

source: Warning: blocking of running user functions which executes window messages with commands such as "MsgBox()" can lead to unexpected behavior, the return to the system should be as fast as possible !!!
fr: Attention: le blocage de l'exécution des fonctions utilisateur qui exécutent les messages de fenêtre avec des commandes comme "MsgBox()" peut conduire à un comportement inattendu, le retour au système doit être aussi rapide que possible!!!

source: Some controls consume internally specific Windows Message ID, so registering them will have no effect, e.g; WM_CHAR, WM_KEYDOWN, WM_KEYUP are consumed by an edit control.
fr: Certains contrôles consomment en interne des IDs de message Windows spécifiques, de sorte que leur enregistrement n'auront aucun effet, par exemple:WM_CHAR, WM_KEYDOWN, WM_KEYUP sont consommés par un contrôle Edit.

source: Create an ownerdrawn/colored button
fr: Crée un bouton auto-dessiné/coloré

source: Set the ownerdrawn flag
fr: Réglez le drapeau ownerdrawn

source: WM_DRAWITEM has to registered before showing GUI otherwise the initial drawing isn't done
fr: WM_DRAWITEM a été enregistré avant d'afficher la GUI sinon le dessin initial n'est pas fait

source: Normally should not run through cause of our MY_WM_COMMAND function
fr: Normalement, ne doit pas s'exécuter à cause de notre fonction MY_WM_COMMAND

source: React on a button click
fr: Réagit sur un clic de bouton

source: Check for IDCANCEL - 2
fr: Vérifie IDCANCEL - 2

source: Ownerdrawn buttons don't send something by pressing ENTER
fr: Les boutons Ownerdrawn n'envoient pas quelque chose en appuyant sur ENTER

source: So IDOK - 1 comes up, now check for the control that has the current focus
fr: Donc IDOK - 1 apparait, maintenant vérifie le contrôle qui a le focus courant

source: Only workout clicking on the button
fr: Workout Seulement en cliquant sur le bouton

source: Proceed the default AutoIt3 internal message commands.
fr: Exécute les commandes par défaut des messages internes d'AutoIt3 .

source: You also can complete let the line out.
fr: Vous pouvez aussi compléter la ligne.

source: But only 'Return' (without any value) will not proceed
fr: Mais seulement 'Return' (sans valeur) traitera

source: the default AutoIt3-message in the future !!!
fr: le message par défaut de AutoIt3 dans l'avenir!!!

source: RePost a WM_COMMAND message to a ctrl in a gui window
fr: Republie un message WM_COMMAND à un contrôle de la fenêtre GUI

source: Draw the button
fr: Dessine le bouton

source: Local $nCtrlID = DllStructGetData($tDrawItem, 2)
fr: $Locale = nCtrlID DllStructGetData ($tDrawItem, 2)

source: Proceed the default AutoIt3 internal message commands
fr: Traite les commandes de message interne par défaut AutoIt3

source: The main drawing procedure
fr: Procédure principale de dessin

source: Local Const $ODS_CHECKED = 0x0008
fr: Const local $ODS_CHECKED = 0x0008

source: Local Const $ODS_HOTLIGHT = 0x0040
fr: Const local $ODS_HOTLIGHT = 0x0040

source: Local Const $ODS_INACTIVE = 0x0080
fr: Const local $ODS_INACTIVE = 0x0080

source: Local Const $ODS_NOACCEL = 0x0100
fr: Const local $ODS_NOACCEL = 0x0100

source: Local Const $ODS_NOFOCUSRECT = 0x0200
fr: Const local $ODS_NOFOCUSRECT = 0x0200

source: Local $bChecked = BitAND($nItemState, $ODS_CHECKED)
fr: $Locale = bChecked bitand ($nItemState, $ODS_CHECKED)

source: Some graphic / windows functions
fr: Quelques fonctions graphiques ou de fenêtres

source: Sets the accelerator table to be used in a GUI window.
fr: Définit les raccourcis clavier (accélérateurs) pour une fenêtre GUI.

source: A 2 dimensional array holding the accelerator table (See remarks).
fr: Tableau à deux dimensions contenant la table des raccourcis clavier (Voir Remarques).

source: The array passed to this function contains the hotkey and the control ID of the accelerator.
fr: Le tableau passé à cette fonction contient les raccourcis et l'ID du contrôle accélérateur.

source: The array must be defined as Local/Global $aArray[n][2] - where n is the number of accelerator keys to set:
fr: Le tableau doit être défini comme Local/Global $aArray[n][2] - où n est le nombre de raccourcis clavier à définir :

source: $aArray[0][0] = Hotkey (in HotKeySet() format) of 1st accelerator
fr: $aArray[0][0] = Raccourci clavier (dans le format HotKeySet()) du 1er accélérateur

source: $aArray[0][1] = Control ID of the 1st accelerator, as returned by GUICtrlCreate...
fr: $aArray[0][1] = ID du contrôle du 1er accélérateur, tel que renvoyé par GUICtrlCreate...

source: $aArray[1][0] = Hotkey of 2nd accelerator
fr: $aArray[1][0] = Raccourci de 2e accélérateur

source: $aArray[1][1] = Control ID of the 2nd accelerator
fr: $aArray[1][1] = ID du contrôle du 2ème accélérateur

source: $aArray[n][0] = Hotkey of nth accelerator
fr: $aArray[n][0] = Touche de raccourci du n-ième accélérateur

source: $aArray[n][1] = Control ID of the nth accelerator
fr: $aArray[n][1] = ID du contrôle du n-ième accélérateur

source: Passing this function a non-array will unset all accelerators for the given winhandle.
fr: En passant à cette fonction autre chose qu'un tableau aura pour effet d'annuler tous les accélérateurs pour un handle Windows donné.

source: Set GUIAccelerators for the button controlIDs, these being Ctrl + y and Ctrl + n
fr: Définit les GUIAccelerators pour les controlIDs boutons, à savoir Ctrl+y et Ctrl+n

source: Displays if the button was selected or the hotkey combination Ctrl + y was pressed.
fr: Affiche si le bouton a été sélectionné ou la combinaison de touches Ctrl+y a été pressée.

source: Displays if the button was selected or the hotkey combination Ctrl + n was pressed.
fr: Affiche si le bouton a été sélectionné ou la combinaison de touches Ctrl+n a été enfoncée.

source: Delete the GUI.
fr: Supprime la GUI.

source: Sets the background color of the GUI window.
fr: Définit la couleur de fond de la fenêtre GUI.

source: Background color of the dialog box.
fr: La couleur de fond de la boîte de dialogue.

source: Sets absolute coordinates for the next control.
fr: Définit les coordonnées absolues pour le contrôle suivant.

source: To be used specifically in Opt ("GUICoordMode", 2).
fr: Pour être utilisé spécifiquement dans Opt ("GUICoordMode", 2) .

source: It allows you to set the current position to a precise point and from that position to create controls by row (x_offset,-1) or by columns (-1, y_offset).
fr: Cette fonction vous permet de définir la position courante en un point précis et à partir de cette position créer des contrôles par ligne (x_offset, -1) ou par colonne (-1, y_offse ).

source: relative to cell mode
fr: par rapport au mode cellule

source: next cell in the line
fr: prochaine cellule dans la ligne

source: Sets the mouse cursor icon for a GUI window.
fr: Définit l'icône du curseur de la souris pour une fenêtre GUI.

source: Cursor Id (See Remarks).
fr: Id du curseur (Voir Remarques).

source: Force the requested mouse cursor even when over controls (see below).
fr: Force le curseur souris requis, même lorsqu'il se trouve sur d'autres contrôles (voir ci-dessous ).

source: 0 = (default) Don't override a control's default mouse cursor.
fr: 0 = (par défaut) ne pas remplacer le curseur souris par défaut d'un contrôle.

source: 1 = override control's default mouse cursor.
fr: 1 = curseur souris par défaut du contrôle survolé.

source: Usually when you move the mouse cursor over an edit control or other control the mouse cursor changes shape.
fr: Habituellement, lorsque vous déplacez le curseur souris sur un contrôle Edit ou un autre contrôle le curseur souris change de forme.

source: The "override" option allows you to force the requested mouse cursor to be shown at all times.
fr: L'option "override" vous permet de forcer le curseur souris demandé à être utilisé tout le temps.

source: If you have changed a controls mouse cursor with GUICtrlSetCursor() then this control mouse cursor will always be shown.
fr: Si vous avez modifié le curseur souris d'un contrôle avec GUICtrlSetCursor(), ce curseur sera toujours affichée.

source: Sets the default font for a GUI window.
fr: Définit la police par défaut pour une fenêtre GUI.

source: Font to use.
fr: Nom de la police à utiliser.

source: $NONANTIALIASED_QUALITY (3) = Font is never anti aliased.
fr: $NONANTIALIASED_QUALITY ( 3 ) = la police n'est jamais anti-crénelé.

source: $ANTIALIASED_QUALITY (4) = Font is always anti aliased if the font supports it and the size of the font is not too small or too large.
fr: $ANTIALIASED_QUALITY ( 4 ) = la police est toujours anti-crénelé si la police le prend en charge et si la taille de la police n'est pas trop petit ou trop grande.

source: $CLEARTYPE_QUALITY (5) = If set, text is rendered (when possible) using ClearType anti aliasing method.
fr: $CLEARTYPE_QUALITY ( 5 ) = Si défini, le rendu du texte est obtenu (si possible) en utilisant la méthode ClearType d'antialiasing.

source: See the remarks on the MSDN page for LOGFONT for details about when ClearType is not available.
fr: Voir Remarques sur la page MSDN pour LOGFONT pour savoir quand ClearType n'est pas disponible.

source: If neither $ANTIALIASED_QUALITY nor $NONANTIALIASED_QUALITY is selected, the font is anti aliased only if the user chooses smooth screen fonts in Control Panel.
fr: Si ni $ANTIALIASED_QUALITY ni $NONANTIALIASED_QUALITY n'est sélectionné, la police est anti-crénelée seulement si l'utilisateur choisit les polices d'écran lisses dans le Panneau de configuration.

source: For some control as label ones the default can be 8.5 instead of 9 according to Windows Theme Values.
fr: Pour certains contrôles tels que les Label, la taille par défaut peut être de 8,5 au lieu de 9 en accord avec les valeurs du thème de Windows.

source: will display underlined characters
fr: Affiche des caractères soulignés

source: Sets an executable file that will be run when F1 is pressed.
fr: Définit un fichier exécutable qui sera exécuté lorsque F1 sera pressé.

source: file that will be run if F1 is pressed when the GUI is active.
fr: Fichier qui sera exécuté avec F1 lorsque la GUI est active.

source: Defines a user function to be called when a system button is clicked.
fr: Définit une fonction utilisateur à appeler quand un bouton système est cliqué.

source: See the Special ID table below.
fr: Consultez le Tableau des IDs Spéciaux ci-dessous.

source: Special ID table
fr: Tableau des IDs Spéciaux

source: Special Id
fr: Identifiant Spécial

source: GUI set parameters functions Reference
fr: GUI set parameters - Référence Fonctions

source: Sets the icon used in a GUI window.
fr: Définit l'icône utilisée dans une fenêtre GUI.

source: Changes the state of a GUI window.
fr: Modifie l'état d'une fenêtre GUI.

source: Changes the styles of a GUI window.
fr: Modifie les styles d'une fenêtre GUI.

source: @SW_SHOW = Shows a previously hidden window (default)
fr: @SW_SHOW = Affiche une fenêtre précédemment caché (par défaut)

source: @SW_HIDE = Hide window
fr: @SW_HIDE = Cache la fenêtre

source: @SW_MINIMIZE = Minimize window
fr: @SW_MINIMIZE = Minimise la fenêtre

source: @SW_MAXIMIZE = Maximize window
fr: @Fenêtre SW_MAXIMIZE = Maximise

source: @SW_RESTORE = Undoes a window minimization
fr: @SW_RESTORE = Annule une minimisation de la fenêtre

source: @SW_DISABLE = Disables the window
fr: @SW_DISABLE = Désactive la fenêtre

source: @SW_ENABLE = Enables the window
fr: @SW_ENABLE = Active la fenêtre

source: @SW_LOCK = Lock the window to avoid repainting.
fr: @SW_LOCK = Verrouille la fenêtre pour éviter de la repeindre.

source: @SW_UNLOCK = Unlock windows to allow painting.
fr: @SW_UNLOCK = Déverouille la fenêtre pour permettre la peinture.

source: @SW_SHOWDEFAULT - Sets the show state based on the SW_ flag specified in the STARTUPINFO structure
fr: @SW_SHOWDEFAULT - Définit l'état d'affichage basé sur le drapeau SW_ spécifié dans la structure STARTUPINFO
